In [2]:
import pandas as pds

In [6]:
sales = pds.read_csv('sales.csv')

In [8]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2935849 entries, 0 to 2935848
Data columns (total 5 columns):
 #   Column        Dtype
---  ------        -----
 0   date          object
 1   shop_id       int64
 2   item_id       int64
 3   item_price    float64
 4   item_cnt_day  float64
dtypes: float64(2), int64(2), object(1)
memory usage: 112.0+ MB

In [9]:
sales.isnull().sum()

date            0
shop_id         0
item_id         0
item_price      0
item_cnt_day    0
dtype: int64

In [21]:
sales['date'].head(1)

0    02.01.2013
Name: date, dtype: object

In [19]:
sales['date'].tail(1)

2935848    03.10.2015
Name: date, dtype: object

In [40]:
sales['date'].unique() # 섞여있다

array(['02.01.2013', '03.01.2013', '05.01.2013', ..., '28.10.2015',
       '25.10.2015', '13.10.2015'], dtype=object)

In [42]:
sales.sort_values('date')

               date  shop_id  item_id  item_price  item_cnt_day      date2
16164    01.01.2013       28    11613      1499.0           1.0 2013-01-01
101474   01.01.2013       51    10283       667.0           1.0 2013-01-01
10197    01.01.2013       19     2828       499.0           1.0 2013-01-01
101457   01.01.2013       51    10390       150.0           1.0 2013-01-01
101455   01.01.2013       51    10591       110.0           1.0 2013-01-01
...             ...      ...      ...         ...           ...        ...
2263531  31.12.2014       10    15784       195.0           1.0 2014-12-31
2238358  31.12.2014       31    18624       499.0           1.0 2014-12-31
2238360  31.12.2014       31    18622       169.0           1.0 2014-12-31
2210313  31.12.2014       59     9412       299.0           1.0 2014-12-31
2239634  31.12.2014       34    15336       529.0           1.0 2014-12-31

[2935849 rows x 6 columns]

In [11]:
sales['shop_id'].value_counts()

31    235636
25    186104
54    143480
28    142234
57    117428
42    109253
27    105366
6      82663
58     71441
56     69573
46     66321
50     65173
19     63911
15     59511
35     58445
21     58133
7      58076
47     56695
26     53910
18     53227
24     53032
53     52921
16     52734
30     50860
29     49225
38     46013
22     45434
51     44433
52     43502
59     42108
41     41967
37     39638
44     39530
43     39282
4      38242
5      38179
14     36979
45     35891
55     34769
12     34694
2      25991
3      25532
17     22950
48     21612
10     21397
13     17824
49     15849
39     13440
0       9857
32      7947
23      6963
34      5752
1       5678
33      5027
40      4257
9       3751
8       3412
20      1792
11       499
36       306
Name: shop_id, dtype: int64

In [44]:
len(sales['shop_id'].unique())

60

In [12]:
sales['item_id'].value_counts()

20949    31340
5822      9408
17717     9067
2808      7479
4181      6853
         ...
579          1
19388        1
19326        1
6992         1
7640         1
Name: item_id, Length: 21807, dtype: int64

In [45]:
len(sales['item_id'].unique())

21807

In [46]:
sales['item_price'].mean()

890.8532326979881

In [47]:
sales['item_price'].median()

399.0

In [16]:
sales['item_price'].max()

307980.0

In [17]:
sales['item_price'].min()

-1.0

In [22]:
sales[sales['item_price'] == -1.0]

              date  shop_id  item_id  item_price  item_cnt_day
484683  15.05.2013       32     2973        -1.0           1.0

In [49]:
sales[sales['item_price'] == sales['item_price'].max()]

               date  shop_id  item_id  item_price  item_cnt_day      date2
1163158  13.12.2013       12     6066    307980.0           1.0 2013-12-13

In [52]:
sales[sales['item_id'] == 2973]

               date  shop_id  item_id  item_price  item_cnt_day      date2
352      15.01.2013       25     2973     2499.00          13.0 2013-01-15
353      16.01.2013       25     2973     2499.00           5.0 2013-01-16
354      17.01.2013       25     2973     2499.00           3.0 2013-01-17
355      18.01.2013       25     2973     2499.00           2.0 2013-01-18
356      19.01.2013       25     2973     2499.00           3.0 2013-01-19
...             ...      ...      ...         ...           ...        ...
1765321  22.06.2014       57     2973     1249.50           1.0 2014-06-22
1782298  09.06.2014       47     2973     1249.00           1.0 2014-09-06
1851765  04.07.2014       26     2973     1249.50           1.0 2014-04-07
1923837  06.08.2014        6     2973     1249.50           1.0 2014-06-08
2131937  20.11.2014       51     2973     1832.37           1.0 2014-11-20

[780 rows x 6 columns]

In [51]:
sales[sales['item_id'] == 6066]

               date  shop_id  item_id  item_price  item_cnt_day      date2
1163158  13.12.2013       12     6066    307980.0           1.0 2013-12-13

In [35]:
item_id.groupby('item_id')['item_price'].value_counts()

item_id  item_price
2973      2499.000000    444
          1249.500000    124
          1249.000000     96
          1901.000000     28
          1250.000000     12
          2498.500000     12
          1562.030000     10
          1275.010000      9
          2498.750000      6
          1275.270000      3
          1329.290000      3
          1487.610000      3
          1837.850000      3
          1999.000000      3
          1453.000000      2
          2498.900000      2
         -1.000000         1
          1049.000000      1
          1248.700000      1
          1248.900000      1
          1249.100000      1
          1297.580000      1
          1388.400000      1
          1454.120000      1
          1523.910000      1
          1832.370000      1
          1998.400000      1
          2248.800000      1
          2249.000000      1
          2373.950000      1
          2427.571429      1
          2498.400000      1
          2498.700000      1
          2498.833333      1
          2498.875000      1
          2498.916667      1
Name: item_price, dtype: int64

In [14]:
sales.groupby('item_id')['item_price'].value_counts()

item_id  item_price
0        58.0          1
1        4490.0        6
2        58.0          2
3        58.0          1
         100.0         1
                      ..
22167    284.0         1
         287.0         1
22168    799.0         5
         798.5         1
22169    4349.0        1
Name: item_price, Length: 120216, dtype: int64

In [15]:
sales['item_cnt_day'].value_counts()

1.0       2629372
2.0        194201
3.0         47350
4.0         19685
5.0         10474
           ...
251.0           1
501.0           1
112.0           1
164.0           1
2169.0          1
Name: item_cnt_day, Length: 198, dtype: int64

In [53]:
sales['shop_id'].value_counts()

31    235636
25    186104
54    143480
28    142234
57    117428
42    109253
27    105366
6      82663
58     71441
56     69573
46     66321
50     65173
19     63911
15     59511
35     58445
21     58133
7      58076
47     56695
26     53910
18     53227
24     53032
53     52921
16     52734
30     50860
29     49225
38     46013
22     45434
51     44433
52     43502
59     42108
41     41967
37     39638
44     39530
43     39282
4      38242
5      38179
14     36979
45     35891
55     34769
12     34694
2      25991
3      25532
17     22950
48     21612
10     21397
13     17824
49     15849
39     13440
0       9857
32      7947
23      6963
34      5752
1       5678
33      5027
40      4257
9       3751
8       3412
20      1792
11       499
36       306
Name: shop_id, dtype: int64

In [54]:
sales['item_id'].value_counts()

20949    31340
5822      9408
17717     9067
2808      7479
4181      6853
         ...
579          1
19388        1
19326        1
6992         1
7640         1
Name: item_id, Length: 21807, dtype: int64

In [56]:
sales[sales['item_cnt_day'] == sales['item_cnt_day'].max()]

               date  shop_id  item_id  item_price  item_cnt_day      date2
2909818  28.10.2015       12    11373    0.908714        2169.0 2015-10-28

In [57]:
sales['item_cnt_day'].min()

-22.0

In [59]:
sales[sales['item_cnt_day'] < 0]

               date  shop_id  item_id  item_price  item_cnt_day      date2
2        05.01.2013       25     2552       899.0          -1.0 2013-05-01
148      23.01.2013       25     2321       999.0          -1.0 2013-01-23
175      07.01.2013       25     2199      1449.0          -1.0 2013-07-01
807      02.01.2013       25     2330       599.0          -1.0 2013-02-01
1041     13.01.2013       25     5034      1989.0          -1.0 2013-01-13
...             ...      ...      ...         ...           ...        ...
2934243  26.10.2015       25     3917       449.0          -1.0 2015-10-26
2934462  18.10.2015       25     4896      6398.0          -1.0 2015-10-18
2935263  05.10.2015       25    10039       249.0          -1.0 2015-05-10
2935643  16.10.2015       25     7893      2990.0          -1.0 2015-10-16
2935779  07.10.2015       25     7087       999.0          -1.0 2015-07-10

[7356 rows x 6 columns]